{
"team1":{
             "Name":"Munster Rugby",
              "HREF":"#Munster_Rugby",
              "UiBlock":"ui-block-a",
              "ImgPath":"http://www.munsterrugby.ie/images/content/Content-History-Crest-02.gif",
              "Description":"1888Munster Branch founded The province defeats Leinster at the fourth time of asking and as a result are granted a position on the Irish selection committee. 1905 Played hosts to Dave Gallaghers Invincible New Zealand All-Blacks - the Match was played at the Markets Field, Limerick and ended with the tourists running out winners by a big margin.1938 Munster played their first ever match at Thomond Park and celebrate the occasion with victory over Leinster.1947 An injury time try gives Australia victory over Munster by the narrowest of margins at the Mardyke in Cork.1951 More heart break as a hotly disputed try enables South Africa gain the verdict at Thomond Park.1958 The spoils are shared with Australia on the first visit of the Wallabies to Limerick.1962 A late scoring burst fails to save Canada as they go under to a determined home side at Musgrave Park.1963 Munster line out against New Zealand in Thomond Park and are defeated 6-3 by the touring side. 1967 Success at last - Tom Kiernan leads Munster to an 11-8 victory over Australia at Musgrave Park - in doing so they became the first Irish province to defeat a major touring team.1973 Argentina are held to a draw following a tempestuous match in Limerick - the following autumn a last minute penalty goal by full back Trevor Morris snatches a dramatic 3-3 draw for New Zealand at Musgrave Park. 1978 Munster 12 New Zealand 0 - enough said. 1981 The Australians are defeated for the second time following a vintage performance from Tony Ward at Musgrave Park. 1982 New ground is broken when the province under took a three match tour of Romania. 1992The Wallabies return to the Cork venue twelve years later, on this occasion as World champions, but the result is the same, courtesy of a sensational injury time drop goal by Jim Galvin - Munster claim the spoils! 1995 Pat Murray plays a captains part as he leads his side to victory over Swansea in their initial match in the Heineken Cup at Thomond Park. 2000 The Heineken Cup final is reached but victory goes to Northampton Saints Albeit by the narrowest of margins in the Twickenham decider. 2002 Two years later Leicester Tigers hold out in a controversial finish to deprive Munster the laurels in the final at Cardiff. 2003 The Celtic League is won following victory over Neath, the Welsh All Blacks are well beaten at the finish of an entertaining final at Cardiff. 2005 The now defunct Celtic Cup was won at the expense of the Llanelli Scarlets at Lansdowne Road. 2006 An emotional occasion at the Millennium Stadium ends in victory as Munster are crowned Champions of Europe after victory over a gallant Biarritz side. 2008 Further success as Toulouse are beaten in the decider at the Millennium Stadium and the Heineken Cup returns to the province for the second time in three seasons. 2009 Munster are crowned the 2009 Magners League Champions in Thomond Park. 2011 Munster win the 2010/11 Magners League title by defeating Leinster in the Grand Final in Thomond Park. 2012 Munster are knocked out of the Heineken Cup at quarter final stage, suffering a home defeat to Ulster. Ospreys then do the damage at semi final stage of the RaboDirect PRO12. A younger Munster side produced the only silverware by claiming the British and Irish Cup in Musgrave Park. 2013The province reached the Heineken Cup semi final stage for the sixth time in the competition's history and were knocked out by Clermont Auvergne in a thrilling 16-10 encounter at Stade de la Mosson in Montpellier. The game was to be Ronan O'Gara's last outing in a Munster jersey as he bid an emotional farewell to the travelling supporters that day. The league performances for the season resulted in a disappointing sixth place finish in the table. In addition to O'Gara fellow senior players such as Doug Howlett, and Marcus Horan retired while Peter Stringer moved to Premiership club side Bath RFC.<p> source: http://www.munsterrugby.</p>",
                "Link":"http://www.munsterrugby.ie/home.php"
            },
"team2":{
           "Name":"Leinster Rugby",
          "HREF":"#Leinster_Rugby",
          "UiBlock":"ui-block-b",
          "ImgPath":"http://www.leinsterrugby.ie/images/content/Content-Leinster-Harp-2013.jpg",
          "Description":"The Branch Mission statement:To be the global standard bearer for professional club rugby. To encourage, organise, promote and grow the participation in and playing of rugby in the 12 counties of Leinster.The Leinster Branch was inaugurated at a meeting on the 31st of October, 1879. The meeting was held at Lawrence's premises 63 Grafton Street and was largely attended. Founder Clubs The clubs represented at the meeting were; Wanderers, Lansdowne, Arlington School, Dublin University, Dundalk, Phoenix F.C. and Stephen's Hospital. F. Kennedy (Wanderers) was elected first Hon. Secretary of the Branch and C.B. Croker (Lansdowne) first Hon. Treasurer. The function of the Branch was to organise the game of rugby football in the province. Every year five representatives would be selected to join the IRFU Committee. They would be known was the Leinster Five and would pick the Leinster representative teams. Interprovincial Matches The first Interprovincial matches between Leinster, Ulster and Munster were held in 1875. At this time the matches were played with 20 players a side. Leinster lost to Ulster by a converted try and beat Munster by one goal to nil. Since then there has been a match between these teams annually, with Connacht joining the fold in 1885. All Interprovincial matches were abandoned during the years of the Great War (1914-1918) and the War period (1939-1945), though unofficial matches were played. The first major touring side to play Leinster was a team drawn from the New Zealand Army - the Kiwis, in 1946. Although it was not an official touring side organised by the New Zealand Rugby Union, the quality of the match, which was drawn 10 points each, is still remembered to this day. The first official overseas touring side that came to play Leinster was an Australian touring side in 1957. Since then, Leinster has played against every major touring side from Fiji to France. Schools, Cups and Leagues Leinster Schools Interprovincial matches have been taking place since 1888. Leinster Schools beat the Ulster Schools in Belfast on Saturday, April 7th, by a dropped goal to a try. Their first match against Munster Schools took place on March 18th, 1899, when Leinster won by two tries to one. Connacht joined the fray in 1928.The Leinster Schools Senior Cup, which is one of the biggest annual events in Leinster Rugby commenced in 1887. The competition is still one of the most prestigious competitions to win in Leinster Rugby to date. The first official Leinster Senior Challenge Cup was created in 1881. Once this knock out competition was firmly established, there was a natural demand for a competitive league. Thus the Senior Challenge Cup was followed by the Senior League. The other natural progression was the creation of leagues to follow all cups played at all levels of competition such as the Junior Cup and the Junior League, the Third A Cup (Moran Cup) by the Junior 3 League and so on. The early 1920s led to the creation of the Provincial Towns Cup and the Metropolitan Cup, which are still hard fought competitions in the Leinster Rugby calendar. Much has changed in rugby over the years, but the original idea of Leinster Club Rugby acting as a feeder for the Leinster Interprovincial side, though now professional, still stands true.<p> source: http://www.leinsterrugby.ie</p>",
            "Link":"http://www.leinsterrugby.ie/"
            },
"team3":{
           "Name":"Ulster Rugby",
          "HREF":"#Ulster_Rugby",
          "UiBlock":"ui-block-a",
          "ImgPath":"http://irelandsgallery.com/shop/images/uploads/Ulster_RUGBY.jpg",
          "Description":"<p>Ulster Rugby plays in the Heineken Cup and RaboDirect PRO12, and provides the biggest regular supporter numbers for a true 'sport for all' in Northern Ireland. Ulster Rugby, with it's playing and administrative staff based at Ravenhill in Belfast, is the only sport running a full-time professional team based in Northern Ireland. The Ulster Branch, also based at Ravenhill, is reponsible for the game development structure across the Province.Before the Professional Era In the amateur Rugby Union era, Ulster's players trained and competed in their spare time and the team enjoyed considerable success, throughout the 1980's in particular. They regularly played international touring sides from the all over the world such as New Zealand, Australia and Italy. The Interprovincial Championship was viewed as a significant achievement in Irish rugby at the time, with Ulster competing against Munster, Connacht and Leinster for the title.In the early 80's a number of Ulster players such as Colin Patterson, David Irwin, Trevor Ringland and Keith Crossan were selected for the Ireland squad which went on to win the Triple Crown. During the 1984-85 season, Ulster won the Interprovincial Championship for the first time since 1976. The Ulster side strengthened and in the same season they defeated Australia at Ravenhill. Current Ulster Rugby Doctor, David Irwin, captained the side to a 15-13 win- Ulster's first victory over a major touring side with a now legendary performance. The season signalled the start of Ulster's most successful period in their history and with the David Irwin/Willie Anderson axis controlling things on the field, Ulster either won or shared the interprovincial championship every season until the beginning of the professional era (more than any other Irish province) The form of the Ulster players was recognised when in 1987 eight Ulster players were selected to compete with Ireland in the Rugby World Cup where they progressed to the quarter finals.The Beginning of the Professional Era 1999 Harry Williams was Ulster's first coach in the professional era and presided over what is arguably the club's greatest achievement when the side lifted the European Cup in January 1999, defeating French side Colomiers, 21 - 6 in the final at Lansdowne Road. Just eight of the players in the squad during that season were playing rugby professionally with the majority of the squad part-timers, combining a rugby career with a day job. From 2001-04 Ulster Rugby was coached by Alan Solomons, a former Assistant Coach of the Springboks and Head Coach at The Stormers and Western Province in his native South Africa. It was during this time that Ulster Rugby completely embraced the professional era with a roster of full-time players.Solomons coached Ulster to a three year unbeaten home record in the Heineken Cup and in the 2003-04 season Ulster finished second in very a closely contested Celtic League Championship. Without doubt two of his greatest moments with Ulster included the winning of the Celtic Cup on 20th December 2003, defeating Edinburgh 27 - 21 at Murrayfield, and less than a month later, defeating English Premiership giants Leicester Tigers 33 - 0 in the Heineken Cup at Ravenhill.2004 - presentIn July 2004, Mark McCall, himself a member of Ulster's European Cup winning side in 1999, took over the reins as Ulster Rugby Head Coach with European Cup team-mate Allen Clarke as his Assistant and in May 2006, Ulster Rugby were crowned Celtic League champions. In a league season which saw the team win 14, lose 5 and draw 1 match, the competition went down to the wire and Ulster lifted the trophy after defeating The Ospreys 19 - 17 at the Liberty Stadium in Swansea.Celtic League Following the Celtic League success, the 2006-7 season failed to live up to expectations with Ulster dropping to 6th in the Magners League with a disappointing Heineken Cup campaign and in November 2007, Coach Mark McCall resigned. Assistant coach Steve Williams stepped in as Caretaker Coach until new Head Coach Matt Williams was appointed in February 2008. However, despite a difficult season, Ulster ended the 2007-08 season on a high by qualifying for the Heineken Cup.Williams coached Ulster through the 2008-09 season but parted company with Ulster Rugby at the end of that campaign. Ulster went back to their roots, installing a home-grown management set-up with former Irish Skills Coach Brian McLaughlin at the helm. Ulster and Irish legend David Humphreys took on the role of Operations Director, while Jeremy Davidson and Neil Doak joined the set-up as Assistant Coaches. World Cup winning Springboks Johann Muller and Ruan Pienaar joined the Province in 2011 and played a key role as Ulster reached the Heineken Cup quarter finals for the first time since 1999, losing 23-13 to eventual finalists Northampton Saints. The same season, Ulster reached the Magners League play-offs but lost to Leinster, who went on to beat the Saints in the Heineken Cup final.The following year, Ulster reached the knock-out stages of the Heineken Cup final for a second successive season. They beat Munster at Thomond Park in the quarter-final of the competition, a result that marked a milestone in the evolution of the club. Ulster then played Edinburgh in the semi-final at the Aviva Stadium and thanks to the boot of Ruan Pienaar, qualified for the Heineken Cup Final. In what was the final game under Head Coach Brian McLaughlin, Ulster lost the final to inter-provincial rivals Leinster at Twickenham. Mark Anscombe became the first New Zealander to coach Ulster in 2012 and began his time in charge by leading the Province to 16 games unbeaten. The 2012/13 season saw Ulster beat Castres in the Heineken Cup and record the club’s first ever competitive win in France. Ulster qualified for the quarter-final of the Heineken Cup but lost to a Saracens side coached by former Ulster captain Mark McCall. The Province finished top of the RaboDirect PRO12 but lost the final of the competition, again to Leinster.Nevin Spence On 15th September, 2012, Ulster centre, Nevin Spence was killed in a farming accident, along with his brother Graham and father Noel. His tragic death was keenly felt by everyone involved in rugby in Ulster. Captain Johann Mulller said shortly after his death that Nevin Spence would ‘never be forgotten as long as this great club exists.’ In August 2013 it was announced that a new education centre at Ravenhill would be named ‘The Nevin Spence Centre’. Ravenhill In November 2012, work began on a £14.7 million redevelopment of Ravenhill Rugby Grounds. The project, funded by the Department of Culture, Arts and Leisure, (DCAL) saw three new stands built at the ground. The redevelopment saw capacity increase from 11,000 to 18,00 and saw Ravenhill become one of the most modern and state of the art rugby stadiums in Europe. <p> source: http://www.ulsterrugby.com</p>",
            "Link":"http://http://www.ulsterrugby.com/"
            },
"team4":{
           "Name":"Connacht Rugby",
          "HREF":"#Connacht_Rugby",
          "UiBlock":"ui-block-b",
          "ImgPath":"http://www.radiokerry.ie/wp-content/uploads/2013/01/Connacht_Rugby_Crest.png",
          "Description":"Connacht Rugby Est. 1885 Head Coach:Pat lam Club President:Eamonn Feely Club Captains:Michael Swift, John Muldoon and Gavin Duffy Location:Galway, Ireland Competition Participation:RaboDirect PRO12 and Heineken Cup Stadium:The Sportsground (7,500) Highest League Finish:8th (2012,13) Reserve Team Connacht EaglesPlaying Kits Home Kit  2013 Away Kit 2013 European Kit 2013 Jersey – Green, Black Jersey – White, Black, Blue Jersey – Black, Silver Shorts – Green Shorts – Blue Shorts - Black Socks – Green Socks – Blue Socks - Black Connacht Rugby encompasses the professional Rugby Team which competes in the RaboDirect PRO12 and in the 2013/14 Heineken Cup. Connacht Rugby Branch is also responsible for administrating the game of rugby at grassroots level thoughtout the counties of Galway, Mayo, Leitrim, Roscommmon and Sligo. Connacht Rugby finished 8th in the RaboDirect PRO12 in 2012/13 season for the second season in a row under coach Eric Elwood. 2012/13 saw Connacht’s most successful Heineken Cup campaign in the Provinces history securing 3 wins in the pool stages. In the spring of 2013 Connacht appointed Pat Lam as Elwood succor after 25 years playing, coaching and managing the Province. The Connacht Eagles which is a (developmental) side feature in the semi-professional British and Irish Cup. The team represents the IRFU Connacht Branch, which is one of four primary branches of the IRFU and is responsible for rugby union throughout the geographical Irish province of Connacht. The team plays its home games at the Galway Sportsgrounds, which can normally hold 7,500 spectators though is expandable to 9,500 for important games. Connacht play in a predominantly green and black jersey, black shorts and green and black socks. The Connacht Rugby crest is a modified version of the provincial flag of Connacht and consists of a dimidiated eagle and an arm wielding a sword. Through the work of the Connacht Branch and the support of the IRFU, the province over the last five years has had the largest growth in underage and schools participation in Ireland. <p>source: http://www.connachtrugby.ie</p>",
            "Link":"http://www.connachtrugby.ie/"
            }
}